OpenFoam/0.orig/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

flowVelocity         ({{ wind_speed }} 0 0);
pressure             0;
turbulentKE          0.00135;
turbulentOmega       0.0919;

// ************************************************************************* //
