OpenFoam/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    ({{domain_minx}} {{domain_miny}} {{domain_minz}})
    ({{domain_maxx}} {{domain_miny}} {{domain_minz}})
    ({{domain_maxx}} {{domain_maxy}} {{domain_minz}})
    ({{domain_minx}} {{domain_maxy}} {{domain_minz}})
    ({{domain_minx}} {{domain_miny}} {{domain_maxz}})
    ({{domain_maxx}} {{domain_miny}} {{domain_maxz}})
    ({{domain_maxx}} {{domain_maxy}} {{domain_maxz}})
    ({{domain_minx}} {{domain_maxy}} {{domain_maxz}})
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ({{n_x}} {{n_y}} {{n_z}}) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    frontAndBack
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    upperWall
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
